Revit 2024 API
ViewSchedule.RowHeightOverride Property
 Defines the override that is applied to the row height.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public RowHeightOverrideOptions RowHeightOverride { get; set; }
Visual Basic
Public Property RowHeightOverride As RowHeightOverrideOptions
	Get
	Set
Visual C++
public:
property RowHeightOverrideOptions RowHeightOverride {
	RowHeightOverrideOptions get ();
	void set (RowHeightOverrideOptions value);
}
Field Value
None to disable row height override.
All enables row height override for all the body rows in the schedule.
ImageRows enables row height override for all the schedule body rows that contains images or custom graphics.
Remarks
Setting this property to anything but None will allow setting the RowHeight property. This is taken into account when the schedule is viewed as a ScheduleSheetInstance on a ViewSheet.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
ViewSchedule Class
Autodesk.Revit.DB Namespace